
print(f'вариант 4\nПроверка гипотезы о принадлежности генеральным совокупностям крайних членов вариационных рядов по ряду нагрузки N')
from numpy import set_printoptions
from numpy import array, sort, exp, pi, average
X = array([622, 823, 702, 872, 736, 909, 781, 1012, 781, 1122])
N_01 = 622
N_10 = 1122
n = 9
X_mean_sample = average(X)
X_var_sample = sum((x_i - X_mean_sample)**2 for x_i in X) / n
X_std_sample = X_var_sample ** 0.5
r_10 = (N_10-X_mean_sample) / (X_std_sample * (n / (n+1))**0.5)
r_01 = (X_mean_sample-N_01) / (X_std_sample * (n / (n+1))**0.5)
r_crit = 2.294

if r_10 < r_crit:
    print(f'{r_10:.3F} <  {r_crit}\n последний член ряда N принадлежит генеральной совокупности гипотеза подтверждена')
    
else:
    print(f'{r_10:.3F} >  {r_crit}\n последний член ряда N является промахом, гипотеза опровергнута')
    
if r_01 < r_crit:
    print(f'{r_01:.3F} <  {r_crit}\n первый член ряда N принадлежит генеральной совокупности гипотеза подтверждена')
    
else:
    print(f'{r_01:.3F} >  {r_crit}\n первый член ряда N является промахом, гипотеза опровергнута')  

# вариант 4
# Проверка гипотезы о принадлежности генеральным совокупностям крайних членов вариационных рядов по ряду нагрузки N
# 2.026 <  2.294
 # последний член ряда N принадлежит генеральной совокупности гипотеза подтверждена
# 1.516 <  2.294
 # первый член ряда N принадлежит генеральной совокупности гипотеза подтверждена
