
print(f'вариант 4\nПроверка гипотезы о принадлежности генеральным совокупностям крайних членов вариационных рядов по ряду несущей способности R')
from numpy import set_printoptions
from numpy import array, sort, exp, pi, average
X = array([1016, 1113, 1032, 1112, 1063, 1122, 1081, 1146, 1085, 1152, 1083, 1261, 1106, 1201])
R_01 = 1016
R_14 = 1201
n = 13
X_mean_sample = average(X)
X_var_sample = sum((x_i - X_mean_sample)**2 for x_i in X) / n
X_std_sample = X_var_sample ** 0.5
r_14 = (R_14-X_mean_sample) / (X_std_sample * (n / (n+1))**0.5)
r_01 = (X_mean_sample-R_01) / (X_std_sample * (n / (n+1))**0.5)
r_crit = 2.461

if r_14 < r_crit:
    print(f'{r_14:.3F} <  {r_crit}\n последний член ряда R принадлежит генеральной совокупности гипотеза подтверждена')
    
else:
    print(f'{r_14:.3F} >  {r_crit}\n последний член ряда R является промахом, гипотеза опровергнута')
    
if r_01 < r_crit:
    print(f'{r_01:.3F} <  {r_crit}\n первый член ряда R принадлежит генеральной совокупности гипотеза подтверждена')
    
else:
    print(f'{r_01:.3F} >  {r_crit}\n первый член ряда R является промахом, гипотеза опровергнута')  

# вариант 4
# Проверка гипотезы о принадлежности генеральным совокупностям крайних членов вариационных рядов по ряду несущей способности R
# 1.433 <  2.461
 # последний член ряда R принадлежит генеральной совокупности гипотеза подтверждена
# 1.558 <  2.461
 # первый член ряда R принадлежит генеральной совокупности гипотеза подтверждена
