from matplotlib import pyplot as plt
from matplotlib import rcParams
from numpy import array, dot, corrcoef
from numpy import set_printoptions
import numpy as np
from itertools import chain
from pprint import pprint

n=12
x_year = array([277784757.3,	352917701.2, 410864983.6,	461006216.0,	489450798.7,
568386749.7, 655061743.4,	699948879.0,	795407850.6,	854288043.8,	873778705.8,	950257084.9,	960689437.2,	1060560377.0,	1091333468.1,	1193578508.5,	1322563915.0])
x = array((x_year[6:17])) 
nx = array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,])            
x_mean = dot(x, nx) / (11)
x_var = dot(x**2, nx) / 11 - x_mean**2
x_std = x_var**0.5
            
y = array([50.5,	50.8,	52.0,	53.7,	54.7,	55.6,	56.4,	57.4,	56.3,	57.9,	59.3, 60.5])
my = array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,])
y_mean = dot(y[0:11], my) / 11
y_var = dot(y[0:11]**2, my) / 11 - y_mean**2
y_std = y_var**0.5
            
m_xy = np.eye(11)

xy = y[0:11].reshape(11, 1) @ x.reshape(1, 11)

xy_mean = sum(sum(xy * m_xy)) / 11


corr_moment = xy_mean - x_mean*y_mean
corr_coef_0 = corr_moment / (x_std * y_std)

print ('\n'f'текущие затраты {x/1000000} млн. руб.\nпроцент {y[0:11]}\nсдвиг 0 лет\nr(0) = {corr_coef_0:.4F}')

def my_x (m):
    x = array((x_year[(6-m):(18-m)])) 
    nx = array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])            
    x_mean = dot(x, nx) / n
    x_var = dot(x**2, nx) / n - x_mean**2
    x_std = x_var**0.5
            
    y = array([50.5,	50.8,	52.0,	53.7,	54.7,	55.6,	56.4,	57.4,	56.3,	57.9,	59.3,	60.5,])
    my = array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])
    y_mean = dot(y, my) / n
    y_var = dot(y**2, my) / n - y_mean**2
    y_std = y_var**0.5
            
    m_xy = np.eye(n)
    xy = y.reshape(n, 1) @ x.reshape(1, n)
    xy_mean = sum(sum(xy * m_xy)) / n

    corr_moment = xy_mean - x_mean*y_mean
    corr_coef = corr_moment / (x_std * y_std)
    return corr_coef
    
my_array = (corr_coef_0,my_x(1),my_x(2),my_x(3),my_x(4),my_x(5),my_x(6),)
max_element = np.max(my_array)

for m in range(1,7,1) :
    my_x(m)
    if m == 6 or m == 5:
        r = ("лет") 
    if m == 1:
        r = ("год")
    if m == 2 or m == 3 or m == 4:
        r = ("года")
    print ('\n'f'текущие затраты {x_year[(6-m):(17-m)]/1000000} млн. руб.\nпроцент {y}\nсдвиг {m} {r}\nr = {my_x(m):.4F}')
    
print ('\n'f' максимальный коэффициент  = {max_element}')

# вывод в терминале

# текущие затраты [ 655.0617434  699.948879   795.4078506  854.2880438  873.7787058
  # 950.2570849  960.6894372 1060.560377  1091.3334681 1193.5785085
 # 1322.563915 ] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3]
# сдвиг 0 лет
# r(0) = 0.9638

# текущие затраты [ 568.3867497  655.0617434  699.948879   795.4078506  854.2880438
  # 873.7787058  950.2570849  960.6894372 1060.560377  1091.3334681
 # 1193.5785085] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 1 год
# r = 0.9756

# текущие затраты [ 489.4507987  568.3867497  655.0617434  699.948879   795.4078506
  # 854.2880438  873.7787058  950.2570849  960.6894372 1060.560377
 # 1091.3334681] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 2 года
# r = 0.9883

# текущие затраты [ 461.006216   489.4507987  568.3867497  655.0617434  699.948879
  # 795.4078506  854.2880438  873.7787058  950.2570849  960.6894372
 # 1060.560377 ] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 3 года
# r = 0.9836

# текущие затраты [410.8649836 461.006216  489.4507987 568.3867497 655.0617434 699.948879
 # 795.4078506 854.2880438 873.7787058 950.2570849 960.6894372] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 4 года
# r = 0.9828

# текущие затраты [352.9177012 410.8649836 461.006216  489.4507987 568.3867497 655.0617434
 # 699.948879  795.4078506 854.2880438 873.7787058 950.2570849] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 5 лет
# r = 0.9684

# текущие затраты [277.7847573 352.9177012 410.8649836 461.006216  489.4507987 568.3867497
 # 655.0617434 699.948879  795.4078506 854.2880438 873.7787058] млн. руб.
# процент [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# сдвиг 6 лет
# r = 0.9655

 # максимальный коэффициент  = 0.9883067066793779








