number = int(input())
numb_1= int(number)+1
nymb_2 = int(number)-1
print(f"Следующее за числом {number} число: {numb_1}\nДля числа {number} предыдущее число: {nymb_2}")


# вывод
#38
#Следующее за числом 38 число: 39
#Для числа 38 предыдущее число: 37


# пользовательский ввод числа
# переменная на 1 еденицу больше заданного числа
# переменная на 1 еденицу меньше заданного числа
# вывод функции print с f строкой с учетом ввода оператора - конца строки в заданном месте, в фигурных скобках строки переменные