spisok=list(input())
int_spisok=list(map(int,spisok))
from math import prod
print(f'Сумма цифр = {sum(int_spisok)}\nПроизведение цифр = {prod(int_spisok)}')


#235
#Сумма цифр = 10
#Произведение цифр = 30
#>>>

# два дня ушло на решение задачи без индекса элементов
# пользовательский ввод трехзначного числа и преобразование строки в список
# ввод переменной где меняем в списке тип данных на цифровое значение для дальнейших вычислений
# подгружаем функцию умножения элементов
# выводим с использованием f строки сумму и произведение  элементов трехзначного числа с использованием оператора конца строки в заданном месте





